app/controllers/conversations_controller.rb

INSERT INTO "conversations" ("sender_email", "comment", "receiver_email", "receiver_name", "receiver_id", "sender_name", "sender_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def create
    @conversation = Conversation.new(conversation_params)
    @conversation.sender = current_user.email
    @conversation.user_id = current_user.id
    if @conversation.save