app/controllers/posts_controller.rb

    def index
      @new_post = Post.new
      @all_posts = Post.order(created_at: :desc).all
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC