app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "location" = ?, "position" = ?, "school" = ?, "about" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["location", ""], ["position", ""], ["school", ""], ["about", ""], ["updated_at", "2015-07-15 18:36:39.206584"], ["id", 16]]

  def create
    code = "gapinc"
    @user = User.new(user_params)
    if h = User.find{ |h| h['email'] == @user.email.to_str or @user.code.to_str != code}
      redirect_to '/exists'
    elsif @user.save
---
SELECT "users".* FROM "users"
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)